Repository: mlocati/warnings_log
Catalog: languages/*/LC_MESSAGES/messages.po
Languages: it_it

source: Warnings Log
it_it: Registro avvisi

source: Log all the warnings.
it_it: Salva tutti gli avvisi.

source: The folder %s must be writable
it_it: La cartella %s deve essere scrivibile

source: %s PHP extension is not installed
it_it: L’estensione del PHP %s non è installata

source: %s PDO driver is not installed
it_it: Il driver di PDO %s non è installato

source: Failed to create the destination directory
it_it: Non è stato possibile creare la cartella di destinazione

source: Failed to copy file to the destination directory
it_it: Non è stato possibile copiare un file nella cartella di destinazione

source: Warnings Log Settings
it_it: Impostazioni del registro avvisi

source: Error Handling configured successfully.
it_it: La gestione degli avvisi è stata configurata correttamente.

source: Invalid parameter: %s
it_it: Parametro non valido: %s

source: %d element has been hidden
it_it: %s elemento è stato nascosto

source: %d element has been shown
it_it: %s elemento è stato mostrato

source: %d element has been deleted
it_it: %s elemento è stato eliminato

source: Folder %s is writable
it_it: La cartella %s è scrivibile

source: This package must be able to write to the %s directory.
it_it: Questo pacchetto deve poter scrivere nella cartella %s.

source: %s PHP extension installed
it_it: Estensione del PHP %s installata

source: This package needs the %s PHP extension.
it_it: Questo pacchetto richiede l’estensione %s del PHP.

source: %s PDO driver installed
it_it: Driver PDO %s installato

source: This package needs the %s PDO driver.
it_it: Questo pacchetto richiede il driver %s di PDO.

source: Before installing this package, please fix all the above errors.
it_it: Prima di installare questo pacchetto, correggere tutti gli errori succitati.

source: Repeat checks
it_it: Ripeti controlli

source: %s has been installed, but it is not yet active.
it_it: %s è stato installato, tuttavia non è ancora attivo.

source: In order to activate it, please go to <a href="%s">this page</a>.
it_it: Per attivarlo, visitare <a href="%s">questa pagina</a>.

source: Shown Items
it_it: Elementi mostrati

source: Hidden Items
it_it: Elementi nascosti

source: Items Selected
it_it: Elementi selezionati

source: Hide
it_it: Nascondi

source: Show
it_it: Mostra

source: Delete
it_it: Elimina

source: Reload list
it_it: Ricarica elenco

source: Auto-reload list
it_it: Auto-ricarica elenco

source: Error Handling
it_it: Gestione errori

source: Use default error handler
it_it: Usa il gestore degli errori predefinito

source: Activate Warnings Log
it_it: Attiva Registro avvisi

source: Custom provider (%s)
it_it: Gestore personalizzato (%s)

source: Since the error handling is initialized at an early stage of the execution, warnings may be intercepted even before the database is configured (and even before concrete5 is installed).
it_it: Dal momento che la gestione degli errori viene inizializzata durante la fase iniziale dell’esecuzione, gli avvisi possono essere intercettati anche prima che il database venga configurato (e anche prima di installare concrete5).

source: For these reasons, the database used to save the errors/warnings is not the one used by this concrete5 installation, but it's a SQLite file called %1$s created in your %2$s directory
it_it: Per questi motivi il database utilizzato per salvare gli errori/avvisi non è quello usato da questa installazione di concrete5, ma è un file SQLite chiamato %1$s creato nella propria cartella %2$s

source: Save
it_it: Salva

source: Code
it_it: Codice

source: Message
it_it: Messaggio

source: # Seen
it_it: N°

source: First Seen
it_it: Primo

source: Last Seen
it_it: Ultimo

source: Call stack
it_it: Stack chiamate

source: Call Stack
it_it: Stack chiamate

source: Close
it_it: Chiudi

source: Error
it_it: Errore
